<?xml version="1.0"?>
<net name="Model0" version="11">
	<layers>
		<layer id="2" name="input_ids" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="input_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="attention_mask" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="24,attention_mask">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="token_type_ids" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="token_type_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="self.embeddings.word_embeddings.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="30522, 768" offset="0" size="46881792" />
			<output>
				<port id="0" precision="FP16" names="self.embeddings.word_embeddings.weight">
					<dim>30522</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="self.embeddings.word_embeddings.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>30522</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>30522</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="__module.embeddings.word_embeddings/aten::embedding/Convert" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="__module.embeddings.word_embeddings/aten::embedding/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="46881792" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="7" name="__module.embeddings.word_embeddings/aten::embedding/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>30522</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="81,inputs_embeds">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="self.embeddings.token_type_embeddings.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="2, 768" offset="46881796" size="3072" />
			<output>
				<port id="0" precision="FP16" names="self.embeddings.token_type_embeddings.weight">
					<dim>2</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="self.embeddings.token_type_embeddings.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>2</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="__module.embeddings.token_type_embeddings/aten::embedding/Convert" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="__module.embeddings.token_type_embeddings/aten::embedding/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="46881792" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="12" name="__module.embeddings.token_type_embeddings/aten::embedding/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="83,token_type_embeddings.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="__module.embeddings/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="84_1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="self.embeddings.position_embeddings.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="512, 768" offset="46884868" size="786432" />
			<output>
				<port id="0" precision="FP16" names="self.embeddings.position_embeddings.weight">
					<dim>512</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="self.embeddings.position_embeddings.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>512</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="__module.embeddings/aten::slice/Slice" type="Const" version="opset1">
			<data element_type="i64" shape="1, 512" offset="47671300" size="4096" />
			<output>
				<port id="0" precision="I64" names="78">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_54" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="47675396" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="ShapeOf_11314" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Constant_11510" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="47675404" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_11316" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="47675396" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="21" name="Gather_11317" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="10,74,76,77,8">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Constant_57" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="47675404" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_52" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="47675404" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="__module.embeddings/aten::slice/Slice_1" type="Slice" version="opset8">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="I64" names="79,input.1">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="__module.embeddings.position_embeddings/aten::embedding/Convert" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="__module.embeddings.position_embeddings/aten::embedding/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="46881792" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="27" name="__module.embeddings.position_embeddings/aten::embedding/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="86,position_embeddings.1">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="__module.embeddings/aten::add_/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="84,embeddings.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="__module.embeddings.LayerNorm/aten::layer_norm/Multiply" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="47675412" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="__module.embeddings.LayerNorm/aten::layer_norm/MVN" type="MVN" version="opset6">
			<data eps="9.999999960041972e-13" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Constant_11100_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 768" offset="47675416" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Constant_11100" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="__module.embeddings.LayerNorm/aten::layer_norm/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Constant_11101_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 768" offset="47676952" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Constant_11101" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="__module.embeddings.LayerNorm/aten::layer_norm/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="91,input.5">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="self.encoder.layer.0.attention.self.query.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="768, 768" offset="47678488" size="1179648" />
			<output>
				<port id="0" precision="FP16" names="self.encoder.layer.0.attention.self.query.weight">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="self.encoder.layer.0.attention.self.query.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="__module.encoder.layer.0.attention.self.query/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Constant_11102_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 768" offset="48858136" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Constant_11102" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="__module.encoder.layer.0.attention.self.query/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="143,x.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="__module.encoder.layer.0.attention.self/prim::ListConstruct" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="48859672" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="__module.encoder.layer.0.attention.self/aten::view/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="147,x.3">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Constant_305" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="48859704" size="32" />
			<output>
				<port id="0" precision="I64" names="148">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="__module.encoder.layer.0.attention.self/aten::permute/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="149,query_layer.1">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="self.encoder.layer.0.attention.self.key.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="768, 768" offset="48859736" size="1179648" />
			<output>
				<port id="0" precision="FP16" names="self.encoder.layer.0.attention.self.key.weight">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="self.encoder.layer.0.attention.self.key.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="__module.encoder.layer.0.attention.self.key/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Constant_11103_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 768" offset="50039384" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Constant_11103" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="__module.encoder.layer.0.attention.self.key/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="152,x.5">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="__module.encoder.layer.0.attention.self/prim::ListConstruct_1" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="48859672" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="__module.encoder.layer.0.attention.self/aten::view/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="156,x.7">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Constant_339" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="48859704" size="32" />
			<output>
				<port id="0" precision="I64" names="157">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="__module.encoder.layer.0.attention.self/aten::permute/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="158,key_layer.1">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="self.encoder.layer.0.attention.self.value.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="768, 768" offset="50040920" size="1179648" />
			<output>
				<port id="0" precision="FP16" names="self.encoder.layer.0.attention.self.value.weight">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="self.encoder.layer.0.attention.self.value.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="__module.encoder.layer.0.attention.self.value/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Constant_11104_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 768" offset="51220568" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Constant_11104" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="__module.encoder.layer.0.attention.self.value/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="161,x.9">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="__module.encoder.layer.0.attention.self/prim::ListConstruct_2" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="48859672" size="32" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="__module.encoder.layer.0.attention.self/aten::view/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="165,x.11">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Constant_373" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="48859704" size="32" />
			<output>
				<port id="0" precision="I64" names="166">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="__module.encoder.layer.0.attention.self/aten::permute/Transpose_2" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="167,value_layer.1">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Constant_11106_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="51222104" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Constant_11106" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="25" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="47675404" size="8" />
			<output>
				<port id="0" precision="I64" names="25" />
			</output>
		</layer>
		<layer id="70" name="aten::unsqueeze/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="26">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="27" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="51222106" size="8" />
			<output>
				<port id="0" precision="I64" names="27" />
			</output>
		</layer>
		<layer id="72" name="aten::unsqueeze/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="28,33">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="ShapeOf_11322" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Constant_11323" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="47675396" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Constant_11324" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="47675396" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="76" name="Gather_11325" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="13,15">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Constant_8254" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="47675404" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Constant_11329" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="47675404" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Constant_11330" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="47675396" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="80" name="Gather_11331" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="17,19">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="prim::ListConstruct" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="aten::expand/Broadcast" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="37">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="aten::to/Convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="42">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Constant_11105_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="51222104" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Constant_11105" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="aten::rsub/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="aten::rsub/Subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="45,inverted_mask">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="aten::to/Convert_1" type="Convert" version="opset1">
			<data destination_type="boolean" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="BOOL" names="50">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="aten::masked_fill/ConvertLike" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="51222114" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="90" name="aten::masked_fill/Select" type="Select" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="BOOL">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="52,attention_mask_1">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="__module.encoder.layer.0.attention.self/aten::scaled_dot_product_attention/ScaledDotProductAttention" type="ScaledDotProductAttention" version="opset13">
			<data causal="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="168,attn_output.1">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="__module.encoder.layer.0.attention.self/aten::transpose/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="51222118" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="__module.encoder.layer.0.attention.self/aten::transpose/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="169,attn_output.3">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="__module.encoder.layer.0.attention.self/aten::size/ShapeOf_6" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="__module.encoder.layer.0.attention.self/aten::reshape/Reshape" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="171,input.7">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="self.encoder.layer.0.attention.output.dense.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="768, 768" offset="51222134" size="1179648" />
			<output>
				<port id="0" precision="FP16" names="self.encoder.layer.0.attention.output.dense.weight">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="self.encoder.layer.0.attention.output.dense.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="__module.encoder.layer.0.attention.output.dense/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Constant_11107_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 768" offset="52401782" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Constant_11107" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="__module.encoder.layer.0.attention.output.dense/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="177,input.9">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="__module.encoder.layer.0.attention.output/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="179,input.11">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="__module.encoder.layer.0.attention.output.LayerNorm/aten::layer_norm/Multiply" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="47675412" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="__module.encoder.layer.0.attention.output.LayerNorm/aten::layer_norm/MVN" type="MVN" version="opset6">
			<data eps="9.999999960041972e-13" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Constant_11108_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 768" offset="52403318" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Constant_11108" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="__module.encoder.layer.0.attention.output.LayerNorm/aten::layer_norm/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Constant_11109_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 768" offset="52404854" size="1536" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Constant_11109" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="__module.encoder.layer.0.attention.output.LayerNorm/aten::layer_norm/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="183,input.13">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="self.encoder.layer.0.intermediate.dense.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="3072, 768" offset="52406390" size="4718592" />
			<output>
				<port id="0" precision="FP16" names="self.encoder.layer.0.intermediate.dense.weight">
					<dim>3072</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="self.encoder.layer.0.intermediate.dense.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>3072</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>3072</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="__module.encoder.layer.0.intermediate.dense/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>3072</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Constant_11110_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 3072" offset="57124982" size="6144" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Constant_11110" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3072</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="__module.encoder.layer.0.intermediate.dense/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3072</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3072</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="188,input.15">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="__module.encoder.layer.0.intermediate.intermediate_act_fn/aten::gelu/Gelu" type="Gelu" version="opset7">
			<data approximation_mode="ERF" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3072</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="189,input.17">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="self.encoder.layer.0.output.dense.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="768, 3072" offset="57131126" size="4718592" />
			<output>
				<port id="0" precision="FP16" names="self.encoder.layer.0.output.dense.weight">
					<dim>768</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="self.encoder.layer.0.output.dense.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>768</dim>
					<dim>3072</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>3072</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="__module.encoder.layer.0.output.dense/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>3072</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>768</dim>
					<dim>3072</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="Constant_11111_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 768" offset="61849718" size="1536" />
			<output>
