<?xml version="1.0"?>
<net name="placeholder_summarizer" version="10">
    <!-- This is a placeholder OpenVINO IR model. Not functional. -->
    <layers>
        <layer id="0" name="input" type="Parameter" version="opset1">
            <data shape="1,3,224,224" element_type="f32"/>
            <output>
                <port id="0" precision="FP32">
                    <dim>1</dim><dim>3</dim><dim>224</dim><dim>224</dim>
                </port>
            </output>
        </layer>
        <layer id="1" name="output" type="Result" version="opset1">
            <input>
                <port id="0" precision="FP32">
                    <dim>1</dim><dim>1000</dim>
                </port>
            </input>
        </layer>
    </layers>
    <edges>
        <edge from-layer="0" from-port="0" to-layer="1" to-port="0"/>
    </edges>
</net>
